app/Controllers/ControladorCliente.php

SELECT *
FROM `clientes`
---
        public function verCliente(){

            $nuecliente = new Cliente();

            $datosbd['clientes']=$nuecliente->findAll();

SELECT *
FROM `clientes`
WHERE `clientes`.`cliente_id` = '3'
---
        public function editarCliente($cliente_id) {
            $nuecliente = new Cliente();
            $datosbd['cliente'] = $nuecliente->find($cliente_id);